CogneuroResearch/cogneuro-alexa/firmware/box3-capture/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# The BOX-3 module is N16R8: 16MB flash, 8MB octal PSRAM. Capture buffers live in PSRAM.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# HTTPS to Vercel using the bundled root CAs.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_ESP_TLS_INSECURE=n

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Custom table: esp-sr needs a partition named "model". See partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Resolve .local names (cogneuro-pi.local) through mDNS rather than DNS.
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y

# WakeNet inference runs on every 32ms frame, so core 1 is legitimately busy
# almost all the time and its idle task cannot feed the watchdog. Expected for
# always-on audio; without this the watchdog trips during playback.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
